-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: 05 يونيو 2023 الساعة 19:51
-- إصدار الخادم: 10.4.25-MariaDB
-- PHP Version: 8.0.23

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `elmam`
--

-- --------------------------------------------------------

--
-- بنية الجدول `manager`
--

CREATE TABLE `manager` (
  `name` varchar(25) NOT NULL,
  `email` varchar(40) NOT NULL,
  `password` int(25) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- إرجاع أو استيراد بيانات الجدول `manager`
--

INSERT INTO `manager` (`name`, `email`, `password`) VALUES
('joury', 'joury@gmail.com', 12345678);

-- --------------------------------------------------------

--
-- بنية الجدول `room`
--

CREATE TABLE `room` (
  `id` varchar(10) NOT NULL,
  `floor` varchar(15) NOT NULL,
  `name` varchar(10) NOT NULL,
  `type` varchar(25) NOT NULL,
  `capacity` int(4) NOT NULL,
  `Elmam system` int(2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- إرجاع أو استيراد بيانات الجدول `room`
--

INSERT INTO `room` (`id`, `floor`, `name`, `type`, `capacity`, `Elmam system`) VALUES
('cs001', 'الأرضي', 'G3', 'عادية', 30, 0),
('cs002', 'الأرضي', 'G4', 'عادية', 45, 0),
('cs003', 'الأرضي', 'G5', 'عادية', 25, 0),
('cs004', 'الأرضي', 'G6', 'عادية', 28, 0),
('cs005', 'الأرضي', 'G7', 'عادية', 45, 0),
('cs006', 'الأرضي', 'G9', 'عادية', 30, 0),
('cs007', 'الأرضي', 'G11', 'عادية', 45, 0),
('cs008', 'الأرضي', 'G13', 'تفاعلية', 34, 0),
('cs009', 'الأرضي', 'G16', 'عادية', 62, 0),
('cs010', 'الأرضي', 'G20', 'بث', 36, 0),
('cs011', 'الأرضي', 'G21', 'بث', 45, 0),
('cs012', 'الأرضي', 'G30', 'بث', 40, 0),
('cs013', 'الأرضي', 'G36', 'عادية', 58, 0),
('cs014', 'الأرضي', 'G37', 'عادية', 29, 0),
('cs015', 'الأرضي', 'G40', 'عادية', 57, 0),
('cs016', 'الأرضي', 'G38', 'تفاعلية', 38, 0),
('cs017', 'الأرضي', 'G47', 'عادية', 52, 0),
('cs018', 'الأرضي', 'G48', 'عادية', 22, 0),
('cs019', 'الأرضي', 'G49', 'تفاعلية', 27, 0),
('cs020', 'الأرضي', 'G50', 'عادية', 34, 0),
('cs021', 'الأرضي', 'G51', 'عادية', 25, 0),
('cs022', 'الأول', 'F38', 'تفاعلية', 38, 0),
('cs023', 'الأول', 'F37', 'تفاعلية', 36, 0),
('cs024', 'الأول', 'F35', 'تفاعلية', 36, 0),
('cs025', 'الأول', 'F26', 'عادية', 33, 0),
('cs026', 'الأول', 'F19', 'تفاعلية', 31, 0),
('cs027', 'الأول', 'F16', 'عادية', 33, 0),
('cs028', 'الأول', 'F17', 'تفاعلية', 33, 0),
('cs029', 'الأول', 'F15', 'عادية', 51, 0),
('cs030', 'الأول', 'F9', 'عادية', 38, 0),
('cs031', 'الأول', 'F6', 'بث', 21, 0),
('cs032', 'الأول', 'F2', 'بث', 20, 0),
('cs033', 'الأول', 'F1', 'عادية', 26, 0),
('cs034', 'الأول', 'F56', 'بث', 40, 0),
('cs035', 'الأول', 'F55', 'بث', 17, 0),
('cs036', 'الأول', 'F51', 'بث', 29, 0),
('cs037', 'الأول', 'F52', 'بث', 27, 0),
('cs038', 'الأرضي', 'G12', 'معمل', 56, 0),
('cs039', 'الأرضي', 'G15', 'معمل', 40, 0),
('cs040', 'الأول', 'F3', 'معمل', 23, 0),
('cs041', 'الأول', 'F14', 'معمل', 32, 0),
('cs042', 'الأول', 'F12', 'معمل', 56, 0),
('cs043', 'الأول', 'F20', 'معمل', 24, 0),
('cs044', 'الثاني', 'ٍS5', 'معمل', 20, 0),
('cs045', 'الثاني', 'S7', 'معمل', 23, 0),
('cs046', 'الثاني', 'S14', 'معمل', 44, 0),
('cs047', 'الثاني', 'S16', 'معمل', 36, 0),
('cs048', 'الثاني', 'S20', 'معمل', 34, 0),
('cs049', 'الثاني', 'S22', 'معمل', 25, 0),
('cs050', 'الثاني', 'S23', 'معمل', 44, 0),
('cs051', 'الثاني', 'S25', 'معمل', 40, 0),
('cs052', 'الثاني', 'S30', 'معمل', 32, 0),
('cs053', 'الثاني', 'S34', 'معمل', 33, 0),
('cs054', 'الثاني', 'S39', 'معمل', 26, 0),
('cs055', 'الثاني', 'S40', 'عادية', 32, 0),
('cs056', 'الثاني', 'S41', 'معمل', 30, 0),
('cs057', 'الثاني', 'S43', 'عادية', 24, 0),
('cs058', 'الثاني', 'S44', 'عادية', 35, 0),
('cs059', 'الأرضي', 'G35', 'عادية', 28, 0),
('cs060', 'الأول', 'F5', 'عادية', 24, 0),
('cs061', 'الثاني', 'S8', 'عادية', 30, 0);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `manager`
--
ALTER TABLE `manager`
  ADD PRIMARY KEY (`email`);

--
-- Indexes for table `room`
--
ALTER TABLE `room`
  ADD PRIMARY KEY (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
